#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_group.minecraft_container will be created
  + resource "azurerm_container_group" "minecraft_container" {
      + dns_name_label      = "aci-label"
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + ip_address          = (known after apply)
      + ip_address_type     = "public"
      + location            = "australiaeast"
      + name                = "craftlabs_papermc"
      + os_type             = "Linux"
      + resource_group_name = "AZ-AUE-RG-CRAFT-01"
      + restart_policy      = "Always"
      + tags                = {
          + "environment" = "testing"
        }

      + container {
          + commands = (known after apply)
          + cpu      = 1
          + image    = "Phyremaster/papermc-docker"
          + memory   = 2
          + name     = "hello-world"

          + ports {
              + port     = 443
              + protocol = "TCP"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_resource_group.minecraft_container will be created
  + resource "azurerm_resource_group" "minecraft_container" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "AZ-AUE-RG-CRAFT-01"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Validation and Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./terraform`, Workspace: `default`*
